<?php
$weapon_type_dict = array (
		'1' => '剑',
		'2' => '斧头',
		'3' => '短刀',
		'4' => '法杖',
		'5' => '彩绫',
		'6' => '拳套' 
);
$quality_dict = array (
		'1' => '杂物',
		'2' => '凡品',
		'3' => '奇巧',
		'4' => '精粹',
		'5' => '至尊',
		'6' => '传说' 
);
$job_dict = array (
		'검사' => '검사',
		'권사' => '권사',
		'소환사' => '소환사',
		'기공사' => '기공사',
		'역사' => '역사',
		'암살자' => '암살자' 
);
$attr_dict = array (
		'1' => '暴击',
		'2' => '穿刺',
		'3' => '命中',
		'4' => '格挡',
		'5' => '回避',
		'6' => '最大生命',
		'7' => '防御',
		'8' => '暴击防御',
		'9' => '战斗中恢复',
		'10' => '自然恢复',
		'11' => '额外伤害',
		'12' => '暴击伤害',
		'13' => '伤害减免',
		'14' => '攻击力' 
);
$bind_type_dict = array (
		'1' => '',
		'2' => '装备后绑定',
		'3' => '不可交易' 
);
?>